#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.main.aws_ssm_parameter.twitter_api_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiSecret]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_ssm_parameter.twitter_access_token_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessTokenSecret]
module.main.aws_scheduler_schedule_group.group: Refreshing state... [id=lapwing-item-news-dev-scheduler-group]
module.main.aws_ssm_parameter.twitter_api_key: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiKey]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_ssm_parameter.twitter_access_token: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessToken]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.main.aws_iam_policy.lambda_policy has changed
  ~ resource "aws_iam_policy" "lambda_policy" {
      + arn      = "arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy"
        id       = "arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy"
        name     = "lapwing-item-news-dev-lambda-policy"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.main.archive_file.lambda_function will be created
  + resource "archive_file" "lambda_function" {
      + excludes            = [
          + "*.zip",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "/home/runner/work/lapwing-item-news/lapwing-item-news/dist/index.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "/home/runner/work/lapwing-item-news/lapwing-item-news/dist/src"
      + type                = "zip"
    }

  # module.main.aws_iam_policy.lambda_policy is tainted, so must be replaced
-/+ resource "aws_iam_policy" "lambda_policy" {
      ~ arn              = "arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy" -> (known after apply)
      ~ attachment_count = 0 -> (known after apply)
      ~ id               = "arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy" -> (known after apply)
        name             = "lapwing-item-news-dev-lambda-policy"
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPARIS3GSWXI7KOE7HDK" -> (known after apply)
      - tags             = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.main.aws_iam_policy.scheduler_policy will be created
  + resource "aws_iam_policy" "scheduler_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lapwing-item-news-dev-scheduler-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
    }

  # module.main.aws_iam_role_policy_attachment.lambda will be created
  + resource "aws_iam_role_policy_attachment" "lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lapwing-item-news-dev-lambda-role"
    }

  # module.main.aws_iam_role_policy_attachment.scheduler will be created
  + resource "aws_iam_role_policy_attachment" "scheduler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lapwing-item-news-dev-scheduler-role"
    }

  # module.main.aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "/home/runner/work/lapwing-item-news/lapwing-item-news/dist/index.zip"
      + function_name                  = "lapwing-item-news-dev-lambda"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-lambda-role"
      + runtime                        = "nodejs22.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "name"  = "lapwing-item-news"
          + "stage" = "dev"
        }
      + timeout                        = 20
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.main.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = "lapwing-item-news-dev-bucket"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:GetBucketPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::lapwing-item-news-dev-bucket/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region = "ap-northeast-1"
    }

  # module.main.aws_scheduler_schedule.invoke_lambda will be created
  + resource "aws_scheduler_schedule" "invoke_lambda" {
      + action_after_completion      = (known after apply)
      + arn                          = (known after apply)
      + group_name                   = "lapwing-item-news-dev-scheduler-group"
      + id                           = (known after apply)
      + name                         = "lapwing-item-news-dev-scheduler"
      + name_prefix                  = (known after apply)
      + region                       = "ap-northeast-1"
      + schedule_expression          = "cron(0/10 * * * ? *)"
      + schedule_expression_timezone = "Asia/Tokyo"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = (known after apply)
          + role_arn = "arn:aws:iam::087164360110:role/lapwing-item-news-dev-scheduler-role"

          + retry_policy {
              + maximum_event_age_in_seconds = 86400
              + maximum_retry_attempts       = 0
            }
        }
    }

Plan: 8 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment `/deploy 18235340684` on this PR.